IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/MMCSD0_SS_CFG.xml
	<register id="REGS__SS_CFG__SSCFG_CTL_CFG_3_REG" acronym="REGS__SS_CFG__SSCFG_CTL_CFG_3_REG" offset="0x18" width="32" description="The Controller Config 3 Register contains various fields to control the configuration ports on the Arasan eMMC/SD Controller. For detailed functionality of the Arasan eMMC/SD Controller configuration ports please refer to its specification listed in Section 1.2. This register sets the msb fields in the Capabilities Register inside the Arasan eMMC/SD Controller.">
		<bitfield id="HS400SUPPORT" width="1" begin="31" end="31" resetval="0x1" description="HS400 Support. Suggested Value is 1'b1 (The Core supports HS400 Mode). This applies only to eMMC5.0 mode. This should be set to 1'b0 for SD3.0 mode Optionally can be set to 1'b0 if the application doesn't want to support HS400." range="31" rwaccess="R/W"/> 
		<bitfield id="SUPPORT1P8VDD2" width="1" begin="28" end="28" resetval="0x1" description="1.8V VDD2 Support." range="28" rwaccess="R/W"/> 
		<bitfield id="ADMA3SUPPORT" width="1" begin="27" end="27" resetval="0x1" description="ADMA3 Support." range="27" rwaccess="R/W"/> 
		<bitfield id="CLOCKMULTIPLIER" width="8" begin="23" end="16" resetval="0x0" description="Clock Multiplier. This field indicates clock multiplier value of programmable clock generator. Refer to Clock Control register. Setting 00h means that Host Controller does not support programmable clock generator. FFh Clock Multiplier M = 256, ...., 02h Clock Multiplier M = 3, 01h Clock Multiplier M = 2, 00h Clock Multiplier is Not Supported." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="RETUNINGMODES" width="2" begin="15" end="14" resetval="0x0" description="Re-Tuning Modes. Should be set to 2'b00 as the Core supports only the Software Timer based Re-Tuning." range="15 - 14" rwaccess="R/W"/> 
		<bitfield id="TUNINGFORSDR50" width="1" begin="13" end="13" resetval="0x0" description="Use Tuning for SDR50. This bit should be set if the Application wants Tuning be used for SDR50 Modes. The Core operates with or with out tuning for SDR50 mode as long as the Clock can be manually tuned using tap delay." range="13" rwaccess="R/W"/> 
		<bitfield id="RETUNINGTIMERCNT" width="4" begin="11" end="8" resetval="0x4" description="Timer Count for Re-Tuning. This is the Timer Count for Re-Tuning Timer for Re-Tuning Mode 1 to 3. Setting to 4'b0 disables Re-Tuning Timer." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="TYPE4SUPPORT" width="1" begin="7" end="7" resetval="0x0" description="Driver Type 4 Support. This bit should be set based on whether Driver Type 4 for 1.8 Signalling is supported or not." range="7" rwaccess="R/W"/> 
		<bitfield id="DDRIVERSUPPORT" width="1" begin="6" end="6" resetval="0x0" description="Driver Type D Support. This bit should be set based on whether Driver Type D for 1.8 Signalling is supported or not." range="6" rwaccess="R/W"/> 
		<bitfield id="CDRIVERSUPPORT" width="1" begin="5" end="5" resetval="0x0" description="Driver Type C Support. This bit should be set based on whether Driver Type C for 1.8 Signalling is supported or not." range="5" rwaccess="R/W"/> 
		<bitfield id="ADRIVERSUPPORT" width="1" begin="4" end="4" resetval="0x0" description="Driver Type A Support. This bit should be set based on whether Driver Type A for 1.8 Signalling is supported or not." range="4" rwaccess="R/W"/> 
		<bitfield id="DDR50SUPPORT" width="1" begin="2" end="2" resetval="0x1" description="DDR50 Support. Suggested Value is 1'b1 (The Core supports DDR50 mode of operation). Optionally can be set to 1'b0 if the application doesn't want to support DDR50." range="2" rwaccess="R/W"/> 
		<bitfield id="SDR104SUPPORT" width="1" begin="1" end="1" resetval="0x1" description="SDR104 Support. Suggested Value is 1'b1 (The Core supports SDR104 mode of operation). Optionally can be set to 1'b0 if the application doesn't want to support SDR104." range="1" rwaccess="R/W"/> 
		<bitfield id="SDR50SUPPORT" width="1" begin="0" end="0" resetval="0x1" description="SDR50 Support. Suggested Value is 1'b1 (The Core supports SDR50 mode of operation). Optionally can be set to 1'b0 if the application doesn't want to support SDR50." range="0" rwaccess="R/W"/>
	</register>
	<register id="REGS__SS_CFG__SSCFG_CTL_CFG_4_REG" acronym="REGS__SS_CFG__SSCFG_CTL_CFG_4_REG" offset="0x1C" width="32" description="The Controller Config 4 Register contains various fields to control the configuration ports on the Arasan eMMC/SD Controller. For detailed functionality of the Arasan eMMC/SD Controller configuration ports please refer to its specification listed in Section 1.2. This register sets the lsb fields in the Maximum Current Capabilities Register inside the Arasan eMMC/SD Controller.">
		<bitfield id="MAXCURRENT1P8V" width="8" begin="23" end="16" resetval="0x0" description="Maximum Current for 1.8V." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="MAXCURRENT3P0V" width="8" begin="15" end="8" resetval="0x0" description="Maximum Current for 3.0V." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="MAXCURRENT3P3V" width="8" begin="7" end="0" resetval="0x0" description="Maximum Current for 3.3V." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="REGS__SS_CFG__SSCFG_CTL_CFG_5_REG" acronym="REGS__SS_CFG__SSCFG_CTL_CFG_5_REG" offset="0x20" width="32" description="The Controller Config 5 Register contains various fields to control the configuration ports on the Arasan eMMC/SD Controller. For detailed functionality of the Arasan eMMC/SD Controller configuration ports please refer to its specification listed in Section 1.2. This register sets the msb fields in the Maximum Current Capabilities Register inside the Arasan eMMC/SD Controller.">
		<bitfield id="MAXCURRENTVDD2" width="8" begin="7" end="0" resetval="0x0" description="Maximum Current for 1.8 V (VDD2)." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="REGS__SS_CFG__SSCFG_CTL_CFG_6_REG" acronym="REGS__SS_CFG__SSCFG_CTL_CFG_6_REG" offset="0x24" width="32" description="The Controller Config 6 Register contains various fields to control the configuration ports on the Arasan eMMC/SD Controller. For detailed functionality of the Arasan eMMC/SD Controller configuration ports please refer to its specification listed in Section 1.2. This register sets the fields in the Preset Values Register for Initialization inside the Arasan eMMC/SD Controller.">
		<bitfield id="INITPRESETVAL" width="13" begin="12" end="0" resetval="0x256" description="Preset Value for Initialization." range="12 - 0" rwaccess="R/W"/>
	</register>
	<register id="REGS__SS_CFG__SSCFG_CTL_CFG_7_REG" acronym="REGS__SS_CFG__SSCFG_CTL_CFG_7_REG" offset="0x28" width="32" description="The Controller Config 7 Register contains various fields to control the configuration ports on the Arasan eMMC/SD Controller. For detailed functionality of the Arasan eMMC/SD Controller configuration ports please refer to its specification listed in Section 1.2. This register sets the fields in the Preset Values Register for Default Speed inside the Arasan eMMC/SD Controller.">
		<bitfield id="DSPDPRESETVAL" width="13" begin="12" end="0" resetval="0x4" description="Preset Value for Default Speed." range="12 - 0" rwaccess="R/W"/>
	</register>
	<register id="REGS__SS_CFG__SSCFG_CTL_CFG_8_REG" acronym="REGS__SS_CFG__SSCFG_CTL_CFG_8_REG" offset="0x2C" width="32" description="The Controller Config 8 Register contains various fields to control the configuration ports on the Arasan eMMC/SD Controller. For detailed functionality of the Arasan eMMC/SD Controller configuration ports please refer to its specification listed in Section 1.2. This register sets the fields in the Preset Values Register for High Speed inside the Arasan eMMC/SD Controller.">
		<bitfield id="HSPDPRESETVAL" width="13" begin="12" end="0" resetval="0x2" description="Preset Value for High Speed." range="12 - 0" rwaccess="R/W"/>
	</register>
