IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/MMCSD0_SS_CFG.xml
	<register id="REGS__SS_CFG__SSCFG_CTL_CFG_9_REG" acronym="REGS__SS_CFG__SSCFG_CTL_CFG_9_REG" offset="0x30" width="32" description="The Controller Config 9 Register contains various fields to control the configuration ports on the Arasan eMMC/SD Controller. For detailed functionality of the Arasan eMMC/SD Controller configuration ports please refer to its specification listed in Section 1.2. This register sets the fields in the Preset Values Register for SDR12 inside the Arasan eMMC/SD Controller.">
		<bitfield id="SDR12PRESETVAL" width="13" begin="12" end="0" resetval="0x4" description="Preset Value for SDR12." range="12 - 0" rwaccess="R/W"/>
	</register>
	<register id="REGS__SS_CFG__SSCFG_CTL_CFG_10_REG" acronym="REGS__SS_CFG__SSCFG_CTL_CFG_10_REG" offset="0x34" width="32" description="The Controller Config 10 Register contains various fields to control the configuration ports on the Arasan eMMC/SD Controller. For detailed functionality of the Arasan eMMC/SD Controller configuration ports please refer to its specification listed in Section 1.2. This register sets the fields in the Preset Values Register for SDR25 inside the Arasan eMMC/SD Controller.">
		<bitfield id="SDR25PRESETVAL" width="13" begin="12" end="0" resetval="0x2" description="Preset Value for SDR25." range="12 - 0" rwaccess="R/W"/>
	</register>
	<register id="REGS__SS_CFG__SSCFG_CTL_CFG_11_REG" acronym="REGS__SS_CFG__SSCFG_CTL_CFG_11_REG" offset="0x38" width="32" description="The Controller Config 11 Register contains various fields to control the configuration ports on the Arasan eMMC/SD Controller. For detailed functionality of the Arasan eMMC/SD Controller configuration ports please refer to its specification listed in Section 1.2. This register sets the fields in the Preset Values Register for SDR50 inside the Arasan eMMC/SD Controller.">
		<bitfield id="SDR50PRESETVAL" width="13" begin="12" end="0" resetval="0x1" description="Preset Value for SDR50." range="12 - 0" rwaccess="R/W"/>
	</register>
	<register id="REGS__SS_CFG__SSCFG_CTL_CFG_12_REG" acronym="REGS__SS_CFG__SSCFG_CTL_CFG_12_REG" offset="0x3C" width="32" description="The Controller Config 12 Register contains various fields to control the configuration ports on the Arasan eMMC/SD Controller. For detailed functionality of the Arasan eMMC/SD Controller configuration ports please refer to its specification listed in Section 1.2. This register sets the fields in the Preset Values Register for SDR104 inside the Arasan eMMC/SD Controller.">
		<bitfield id="SDR104PRESETVAL" width="13" begin="12" end="0" resetval="0x0" description="Preset Value for SDR104." range="12 - 0" rwaccess="R/W"/>
	</register>
	<register id="REGS__SS_CFG__SSCFG_CTL_CFG_13_REG" acronym="REGS__SS_CFG__SSCFG_CTL_CFG_13_REG" offset="0x40" width="32" description="The Controller Config 13 Register contains various fields to control the configuration ports on the Arasan eMMC/SD Controller. For detailed functionality of the Arasan eMMC/SD Controller configuration ports please refer to its specification listed in Section 1.2. This register sets the fields in the Preset Values Register for DDR50 inside the Arasan eMMC/SD Controller.">
		<bitfield id="DDR50PRESETVAL" width="13" begin="12" end="0" resetval="0x2" description="Preset Value for DDR50." range="12 - 0" rwaccess="R/W"/>
	</register>
	<register id="REGS__SS_CFG__SSCFG_CTL_CFG_14_REG" acronym="REGS__SS_CFG__SSCFG_CTL_CFG_14_REG" offset="0x44" width="32" description="The Controller Config 14 Register contains various fields to control the configuration ports on the Arasan eMMC/SD Controller. For detailed functionality of the Arasan eMMC/SD Controller configuration ports please refer to its specification listed in Section 1.2. This register sets the fields in the Preset Values Register for HS400 inside the Arasan eMMC/SD Controller.">
		<bitfield id="HS400PRESETVAL" width="13" begin="12" end="0" resetval="0x1" description="Preset Value for HS400." range="12 - 0" rwaccess="R/W"/>
	</register>
	<register id="REGS__SS_CFG__SSCFG_CTL_STAT_1_REG" acronym="REGS__SS_CFG__SSCFG_CTL_STAT_1_REG" offset="0x60" width="32" description="The Controller Status 1 Register contains various fields to reflect the status of the debug ports on the Arasan eMMC/SD Controller. For detailed functionality of the Arasan eMMC/SD Controller debug ports please refer to its specification listed in Section 1.2.">
		<bitfield id="SDHC_CMDIDLE" width="1" begin="31" end="31" resetval="0x1" description="Idle signal to enable S/W to gate off the clocks." range="31" rwaccess="R"/> 
		<bitfield id="DMADEBUGBUS" width="16" begin="15" end="0" resetval="0x0" description="DMA_CTRL Debug Bus." range="15 - 0" rwaccess="R"/>
	</register>
	<register id="REGS__SS_CFG__SSCFG_CTL_STAT_2_REG" acronym="REGS__SS_CFG__SSCFG_CTL_STAT_2_REG" offset="0x64" width="32" description="The Controller Status 2 Register contains various fields to reflect the status of the debug ports on the Arasan eMMC/SD Controller. For detailed functionality of the Arasan eMMC/SD Controller debug ports please refer to its specification listed in Section 1.2.">
		<bitfield id="CMDDEBUGBUS" width="16" begin="15" end="0" resetval="0x16" description="CMD_CTRL Debug Bus." range="15 - 0" rwaccess="R"/>
	</register>
	<register id="REGS__SS_CFG__SSCFG_CTL_STAT_3_REG" acronym="REGS__SS_CFG__SSCFG_CTL_STAT_3_REG" offset="0x68" width="32" description="The Controller Status 3 Register contains various fields to reflect the status of the debug ports on the Arasan eMMC/SD Controller. For detailed functionality of the Arasan eMMC/SD Controller debug ports please refer to its specification listed in Section 1.2.">
		<bitfield id="TXDDEBUGBUS" width="16" begin="15" end="0" resetval="0x0" description="TXD_CTRL Debug Bus." range="15 - 0" rwaccess="R"/>
	</register>
	<register id="REGS__SS_CFG__SSCFG_CTL_STAT_4_REG" acronym="REGS__SS_CFG__SSCFG_CTL_STAT_4_REG" offset="0x6C" width="32" description="The Controller Status 4 Register contains various fields to reflect the status of the debug ports on the Arasan eMMC/SD Controller. For detailed functionality of the Arasan eMMC/SD Controller debug ports please refer to its specification listed in Section 1.2.">
		<bitfield id="RXDDEBUGBUS0" width="16" begin="15" end="0" resetval="0x0" description="RXD_CTRL Debug Bus (SD CLK)." range="15 - 0" rwaccess="R"/>
	</register>
	<register id="REGS__SS_CFG__SSCFG_CTL_STAT_5_REG" acronym="REGS__SS_CFG__SSCFG_CTL_STAT_5_REG" offset="0x70" width="32" description="The Controller Status 5 Register contains various fields to reflect the status of the debug ports on the Arasan eMMC/SD Controller. For detailed functionality of the Arasan eMMC/SD Controller debug ports please refer to its specification listed in Section 1.2.">
		<bitfield id="RXDDEBUGBUS1" width="16" begin="15" end="0" resetval="0x8" description="RXD_CTRL Debug Bus (RX CLK)." range="15 - 0" rwaccess="R"/>
	</register>
