IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/MMCSD0_SS_CFG.xml
	<register id="REGS__SS_CFG__SSCFG_CTL_STAT_6_REG" acronym="REGS__SS_CFG__SSCFG_CTL_STAT_6_REG" offset="0x74" width="32" description="The Controller Status 6 Register contains various fields to reflect the status of the debug ports on the Arasan eMMC/SD Controller. For detailed functionality of the Arasan eMMC/SD Controller debug ports please refer to its specification listed in Section 1.2.">
		<bitfield id="TUNDEBUGBUS" width="16" begin="15" end="0" resetval="0x0" description="TUN_CTRL Debug Bus." range="15 - 0" rwaccess="R"/>
	</register>
	<register id="REGS__SS_CFG__SSCFG_PHY_CTRL_1_REG" acronym="REGS__SS_CFG__SSCFG_PHY_CTRL_1_REG" offset="0x100" width="32" description="The PHY Control 1 Register contains various fields to control the ports on the Arasan eMMC/SD PHY. For detailed functionality of the Arasan eMMC/SD PHY control ports please refer to its specification listed in Section 1.2.">
		<bitfield id="DR_TY" width="3" begin="22" end="20" resetval="0x0" description="Drive Source/Sink impedance programming. 0 => 50 Ohms, 1 => 33 Ohms, 2 => 66 Ohms, 3 => 100 Ohms, 4 => 40 Ohms." range="22 - 20" rwaccess="R/W"/> 
		<bitfield id="RETRIM" width="1" begin="17" end="17" resetval="0x0" description="Start CALIO calibration cycle. At positive edge initiates CALIO calibration cycle." range="17" rwaccess="R/W"/> 
		<bitfield id="EN_RTRIM" width="1" begin="16" end="16" resetval="0x1" description="CALIO enable. Enables CALIO, If enabled CALIO will start calibration cycle at phyctrl_pdb positive edge." range="16" rwaccess="R/W"/> 
		<bitfield id="DLL_TRM_ICP" width="4" begin="7" end="4" resetval="0x0" description="Analog DLL's Charge Pump Current Trim. Programs the analog DLL loop gain." range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="ENDLL" width="1" begin="1" end="1" resetval="0x0" description="Enable DLL. Enables the analog DLL circuits." range="1" rwaccess="R/W"/> 
		<bitfield id="PDB" width="1" begin="0" end="0" resetval="0x0" description="CALIO S/M power down bar. SOC asserts after power up sequence is completed." range="0" rwaccess="R/W"/>
	</register>
	<register id="REGS__SS_CFG__SSCFG_PHY_CTRL_2_REG" acronym="REGS__SS_CFG__SSCFG_PHY_CTRL_2_REG" offset="0x104" width="32" description="The PHY Control 2 Register contains various fields to control the ports on the Arasan eMMC/SD PHY. For detailed functionality of the Arasan eMMC/SD PHY control ports please refer to its specification listed in Section 1.2.">
		<bitfield id="OD_RELEASE_STRB" width="1" begin="29" end="29" resetval="0x0" description="Disable an internal 4.7K pull up resistor on STRB line in open drain mode." range="29" rwaccess="R/W"/> 
		<bitfield id="OD_RELEASE_CMD" width="1" begin="28" end="28" resetval="0x0" description="Disable an internal 4.7K pull up resistor on CMD line in open drain mode." range="28" rwaccess="R/W"/> 
		<bitfield id="OD_RELEASE_DAT" width="8" begin="23" end="16" resetval="0x0" description="Disable an internal 4.7K pull up resistor on data lines in open drain mode." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="ODEN_STRB" width="1" begin="13" end="13" resetval="0x0" description="Open Drain Enable on STRB line." range="13" rwaccess="R/W"/> 
		<bitfield id="ODEN_CMD" width="1" begin="12" end="12" resetval="0x0" description="Open Drain Enable on CMD line." range="12" rwaccess="R/W"/> 
		<bitfield id="ODEN_DAT" width="8" begin="7" end="0" resetval="0x0" description="Open Drain Enable on DAT lines." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="REGS__SS_CFG__SSCFG_PHY_CTRL_3_REG" acronym="REGS__SS_CFG__SSCFG_PHY_CTRL_3_REG" offset="0x108" width="32" description="The PHY Control 3 Register contains various fields to control the ports on the Arasan eMMC/SD PHY. For detailed functionality of the Arasan eMMC/SD PHY control ports please refer to its specification listed in Section 1.2.">
		<bitfield id="PU_STRB" width="1" begin="29" end="29" resetval="0x0" description="Enable pull up on STRB line. If ren_strb is high week pull up is enabled on STRB line." range="29" rwaccess="R/W"/> 
		<bitfield id="PU_CMD" width="1" begin="28" end="28" resetval="0x1" description="Enable pull up on CMD line. If ren_cmd is high week pull up is enabled on CMD line." range="28" rwaccess="R/W"/> 
		<bitfield id="PU_DAT" width="8" begin="23" end="16" resetval="0x255" description="Enable pull up on DAT lines. If ren_dat is high week pull up is enabled on DATA lines." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="REN_STRB" width="1" begin="13" end="13" resetval="0x0" description="Enable pull up/down on the STRB line. If pu_strb is high a week pull up is enabled on STRB line, if low week pull down is enabled on STRB line." range="13" rwaccess="R/W"/> 
		<bitfield id="REN_CMD" width="1" begin="12" end="12" resetval="0x1" description="Enable pull up/down on the CMD line. If pu_cmd is high a week pull up is enabled on CMD line, if low week pull down is enabled on CMD line." range="12" rwaccess="R/W"/> 
		<bitfield id="REN_DAT" width="8" begin="7" end="0" resetval="0x255" description="Enable pull up/down on the DAT lines. If pu_dat is high a week pull up is enabled on DATA lines, if low week pull down is enabled on DATA lines." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="REGS__SS_CFG__SSCFG_PHY_CTRL_4_REG" acronym="REGS__SS_CFG__SSCFG_PHY_CTRL_4_REG" offset="0x10C" width="32" description="The PHY Control 4 Register contains various fields to control the ports on the Arasan eMMC/SD PHY. For detailed functionality of the Arasan eMMC/SD PHY control ports please refer to its specification listed in Section 1.2.">
		<bitfield id="STRBSEL" width="8" begin="31" end="24" resetval="0x0" description="Select the Four Taps for each of STRB_90 and STRB_180 Outputs. strbsel[3:2] selects one of the four for STRB_180 and strbsel[1:0] selects the four taps for STRB_90." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="OTAPDLYENA" width="1" begin="20" end="20" resetval="0x0" description="Output Tap Delay Enable. Enables manual control of the TX clock tap delay, for clocking the final stage flops for maintaining Hold requirements on EMMC Interface." range="20" rwaccess="R/W"/> 
		<bitfield id="OTAPDLYSEL" width="4" begin="15" end="12" resetval="0x0" description="Output Tap Delay Select. Manual control of the TX clock tap delay for clocking the final stage flops for maintaining Hold requirements on EMMC Interface." range="15 - 12" rwaccess="R/W"/> 
		<bitfield id="ITAPCHGWIN" width="1" begin="9" end="9" resetval="0x0" description="Input Tap Change Window. It gets asserted by the controller while changing the itapdlysel. Used to gate of the RX clock during switching the clock source while tap is changing to avoid clock glitches." range="9" rwaccess="R/W"/> 
		<bitfield id="ITAPDLYENA" width="1" begin="8" end="8" resetval="0x0" description="Input Tap Delay Enable. This is used for the manual control of the RX clock Tap Delay in non HS200/HS400 modes." range="8" rwaccess="R/W"/> 
		<bitfield id="ITAPDLYSEL" width="5" begin="4" end="0" resetval="0x0" description="Input Tap Delay Select. Manual control of the RX clock Tap Delay in the non HS200/HS400 modes." range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="REGS__SS_CFG__SSCFG_PHY_CTRL_5_REG" acronym="REGS__SS_CFG__SSCFG_PHY_CTRL_5_REG" offset="0x110" width="32" description="The PHY Control 5 Register contains various fields to control the ports on the Arasan eMMC/SD PHY. For detailed functionality of the Arasan eMMC/SD PHY control ports please refer to its specification listed in Section 1.2.">
		<bitfield id="SELDLYTXCLK" width="1" begin="17" end="17" resetval="0x0" description="Select the Delay chain based txclk. Enables the TX clock based delay chain rather than analog DLL based delay chain." range="17" rwaccess="R/W"/> 
		<bitfield id="SELDLYRXCLK" width="1" begin="16" end="16" resetval="0x0" description="Select the Delay chain based rxclk. Enables the RX clock based delay chain rather than analog DLL based delay chain." range="16" rwaccess="R/W"/> 
		<bitfield id="FRQSEL" width="3" begin="10" end="8" resetval="0x0" description="Select the frequency range of DLL operation: 0 => 200MHz to 170 MHz, 1 => 170MHz to 140 MHz, 2 => 140MHz to 110 MHz, 3 => 110MHz to 80MHz, 4 => 80MHz to 50 MHz, 5 => 275Mhz to 250MHz, 6 => 250MHz to 225MHz, 7 => 225MHz to 200MHz." range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="CLKBUFSEL" width="3" begin="2" end="0" resetval="0x0" description="Clock Delay Buffer Select. Selects one of the eight taps in the CLK Delay Buffer based on PVT variation." range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="REGS__SS_CFG__SSCFG_PHY_CTRL_6_REG" acronym="REGS__SS_CFG__SSCFG_PHY_CTRL_6_REG" offset="0x114" width="32" description="The PHY Control 6 Register contains various fields to control the ports on the Arasan eMMC/SD PHY. For detailed functionality of the Arasan eMMC/SD PHY control ports please refer to its specification listed in Section 1.2.">
		<bitfield id="BISTENABLE" width="1" begin="31" end="31" resetval="0x0" description="Internal BIST operation enable. Enables the embedded BIST." range="31" rwaccess="R/W"/> 
		<bitfield id="BISTSTART" width="1" begin="30" end="30" resetval="0x0" description="Internal BIST start. Starts the embedded BIST operation." range="30" rwaccess="R/W"/> 
		<bitfield id="BISTMODE" width="4" begin="27" end="24" resetval="0x0" description="Internal BIST mode Select. Select the embedded BIST mode of operation." range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="TESTCTRL" width="8" begin="7" end="0" resetval="0x0" description="PHY test control: 8'b00010000 => Test EMMC IOs sink impedance, 8'b00010001 => Test EMMC IOs source impedance, 8'b00100000 => Test RX clock phases on data lines, 8'b00110000 => Test TX clock phases on data lines, 8'b01000000 => Test STRB clock phases on data lines." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="REGS__SS_CFG__SSCFG_PHY_STAT_1_REG" acronym="REGS__SS_CFG__SSCFG_PHY_STAT_1_REG" offset="0x130" width="32" description="The PHY Status 1 Register contains various fields to reflect the status of the Arasan eMMC/SD PHY ports. For detailed functionality of the Arasan eMMC/SD PHY status ports please refer to its specification listed in Section 1.2.">
		<bitfield id="RTRIM" width="4" begin="7" end="4" resetval="0x14" description="CALIO Calibration Result. Holds the content of CALIO Impedance Calibration Result." range="7 - 4" rwaccess="R"/> 
		<bitfield id="BISTDONE" width="1" begin="3" end="3" resetval="0x0" description="Internal BIST completed test cycle. Indicates that the embedded BIST has completed the test cycle." range="3" rwaccess="R"/> 
		<bitfield id="EXR_NINST" width="1" begin="2" end="2" resetval="0x0" description="External Resistor on CALIO absent. Indicates trim cycle started and external resistor is absent." range="2" rwaccess="R"/> 
		<bitfield id="CALDONE" width="1" begin="1" end="1" resetval="0x0" description="STATUS, indicate that CALIO Calibration is completed successfully." range="1" rwaccess="R"/> 
		<bitfield id="DLLRDY" width="1" begin="0" end="0" resetval="0x0" description="DLL ready. Indicates that DLL loop is locked." range="0" rwaccess="R"/>
	</register>
	<register id="REGS__SS_CFG__SSCFG_PHY_STAT_2_REG" acronym="REGS__SS_CFG__SSCFG_PHY_STAT_2_REG" offset="0x134" width="32" description="The PHY Status 2 Register contains various fields to reflect the status of the Arasan eMMC/SD PHY ports. For detailed functionality of the Arasan eMMC/SD PHY status ports please refer to its specification listed in Section 1.2.">
		<bitfield id="BISTSTATUS" width="32" begin="31" end="0" resetval="0x0" description="Internal BIST data compare results. BIST cycle data comparison results." range="31 - 0" rwaccess="R"/>
	</register>
</module>